In [20]:
import pandas as pd
b = pd.read_csv('c.csv')
b

   roll      name   age branch
0     1    mukesh  22.0    CSE
1     2  ashutosh   NaN    CSE
2     5     shrey  21.0    CSE
3     3   damodar  21.0    CSE
4     4     kumar  20.0    CSE

In [10]:
b.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7     True
dtype: bool

In [11]:
b.drop_duplicates()

   roll      name  age branch
0     1    mukesh   22    CSE
1     2  ashutosh   20    CSE
2     5     shrey   21    CSE
3     3   damodar   21    CSE
5     4    ranjit   20    CSE

In [12]:
b

   roll      name  age branch
0     1    mukesh   22    CSE
1     2  ashutosh   20    CSE
2     5     shrey   21    CSE
3     3   damodar   21    CSE
4     2  ashutosh   20    CSE
5     4    ranjit   20    CSE
6     5     shrey   21    CSE
7     3   damodar   21    CSE

In [18]:
b

   roll      name   age branch
0     1    mukesh  22.0    CSE
1     2  ashutosh   NaN    CSE
2     5     shrey  21.0    NaN
3     3   damodar  21.0    CSE
4     4       NaN  20.0    CSE

In [19]:
b.dropna()

   roll     name   age branch
0     1   mukesh  22.0    CSE
3     3  damodar  21.0    CSE

In [23]:
b['age']

0    22.0
1     NaN
2    21.0
3    21.0
4    20.0
Name: age, dtype: float64

In [24]:
b['age'].mean()

21.0

In [25]:
b['age'].medn()

AttributeError: 'Series' object has no attribute 'medain'